Repository: EdgarBarrantes/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_list.po
Languages: es_es

source: Plugin List
es_es: Lista de plugins

source: Here is the list of Remix plugins that you will see in the Plugin Manager:
es_es: Esta es la lista de plugins Remix que verá en el Gestor de plugins:

source: Core Plugins
es_es: Plugins del núcleo

source: **File Explorer** &nbsp; ![](images/pi-fe.png)<br> The File Explorers is where you can see the files.<br> profile name: **fileManager** <br>[Documentation](file_explorer.html)
es_es: **Explorador de archivos** &nbsp; ![](images/pi-fe.png)<br> El Explorador de archivos es donde puede ver los archivos.<br> nombre del perfil: **gestor_de_archivos** <br>[Documentation](explorador_de_archivos.html)

source: **Remixd** &nbsp; (No UI) <br>Remixd (with an npm package running locally) connects a folder on your filesystem to the Remix website. Please see the docs for instructions. <br>profile name: **remixd** <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/remixd.html)
es_es: **Remixd** &nbsp; (Sin UI) <br>Remixd (con un paquete npm ejecutándose localmente) conecta una carpeta de su sistema de archivos al sitio web de Remix. Consulte la documentación para obtener instrucciones. <br>nombre del perfil: **remixd** <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/remixd.html)

source: **Solidity Compiler** &nbsp; ![](images/pi-sol.png)<br> Compiles Solidity & YUL. <br>profile name: **solidity** <br>[Documentation](compile.html)
es_es: **Compilador de Solidity** &nbsp; ![](images/pi-sol.png)<br> Compila Solidity & YUL. <br>nombre del perfil: **solidity** <br>[Documentation](compilar.html)

source: **Deploy & Run** &nbsp; ![](images/pi-deploy.png)<br> Deploy & interact with smart contracts on the in-browser chain (JSVM), local nodes, and public networks. <br>profile name: **udapp** <br>[Documentation](run.html)
es_es: **Despliegue y ejecución** &nbsp; ![](images/pi-deploy.png)<br> Despliegue e interactúe con contratos inteligentes en la cadena del navegador (JSVM), nodos locales y redes públicas. <br>nombre del perfil: **udapp** <br>[Documentation](run.html)

source: **Debugger** &nbsp; ![](images/pi-debug.png)<br> Insert breakpoints, step through a contract, check high level and low level parameters, and fetch & debug a transaction of a verified contract. <br>profile name: **debugger** <br>[Documentation](debugger.html)
es_es: **Debugger** &nbsp; ![](images/pi-debug.png)<br> Inserte puntos de interrupción, recorra un contrato, compruebe parámetros de alto y bajo nivel, y obtenga y depure una transacción de un contrato verificado. <br>nombre del perfil: **debugger** <br>[Documentation](debugger.html)

source: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> Run unit test written in Solidity. <br>profile name: **solidityUnitTesting** <br>[Documentation](unittesting.html)
es_es: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> Ejecute pruebas unitarias escritas en Solidity. <br>nombre del perfil: **solidityUnitTesting** <br>[Documentation](unittesting.html)

source: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> Static code analysis is a process to debug the code by examining it and without actually executing the code. This plugin also has integrations with [Slither](slither.html). <br>profile name: **solidityStaticAnalysis** <br>[Documentation](static_analysis.html)
es_es: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> El análisis estático de código es un proceso para depurar el código examinándolo y sin ejecutar realmente el código. Este plugin también tiene integraciones con [Slither](slither.html). <br>nombre de perfil: **solidityStaticAnalysis** <br>[Documentation](static_analysis.html)

source: Additional Plugins
es_es: Plugins adicionales

source: (sorted alphabetically)
es_es: (ordenados alfabéticamente)

source: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compile & Deploy to the Celo blockchain. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/dexfair/celo-remix-plugin) <br>[Make an issue](https://github.com/dexfair/celo-remix-plugin/issues)
es_es: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compile & Deploy to the Celo blockchain. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/dexfair/celo-remix-plugin) <br>[Hacer una emisión](https://github.com/dexfair/celo-remix-plugin/issues)

source: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> Deploy a contract to multiple chains (1 at a time) with the same address. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Make an issue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)
es_es: **Desplegador de contratos** &nbsp; ![](images/pi-deployer.png)<br> Despliegue un contrato en varias cadenas (1 a la vez) con la misma dirección. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Hacer un despliegue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)

source: **Debug Tools for Remix** &nbsp; ![](images/pi-remix-debug-tools.png) &nbsp; <br> Not to be confused with the Debugger, this tool is for plugin devs to help test their plugins & their plugin's API. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/remix-plugin-debug/profile.json): debugPlugin <br>[Documentation](https://github.com/pldespaigne/remix-debug-plugin#-instalation)
es_es: **Herramientas de depuración para Remix** &nbsp; ![](images/pi-remix-debug-tools.png) &nbsp; <br> No debe confundirse con el depurador, esta herramienta es para que los desarrolladores de plugins puedan probar sus plugins y la API de los mismos. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/remix-plugin-debug/profile.json): debugPlugin <br>[Documentation](https://github.com/pldespaigne/remix-debug-plugin#-instalation)

source: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> The Defi Explorer loads the Uniswap V2 Protocol into the File Explorers. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentation](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)
es_es: **Explorador Defi** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> El Explorador Defi carga el Protocolo Uniswap V2 en los Exploradores de Archivos. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentation](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Haga una edición](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)

source: **Defi Tutorials** &nbsp; (main panel) &nbsp; ![](images/pi-defi-tut.png) <br> Learn about UMA. This plugin works with the UMA tutorials plugin. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)
es_es: **Defi Tutoriales** &nbsp; (panel principal) &nbsp; ![](images/pi-defi-tut.png) <br> Aprenda sobre UMA. Este plugin funciona con el plugin de tutoriales UMA. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[Hacer una edición](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)

source: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Version Control <br> Clone repos from github & create GIT repos & use standard git commands. Also export/import to IPFS. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentation](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Make an issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)
es_es: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Control de versiones <br> Clone repos desde github y cree repos GIT y utilice comandos git estándar. También exportar/importar a IPFS. <br>[nombre de perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentation](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Make an issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)

source: **EthDoc Documentation Generator** &nbsp; ![](images/pi-ethdoc.png) &nbsp; <br>Creates the documentation of a soldity contract - generated from the Natspec comments in the code. The generated doc is placed in EthDoc viewer - which will be visible in an tab in the editor. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc/profile.json): ethdoc <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-ethdoc-plugin/issues)
es_es: **Generador de documentación EthDoc** &nbsp; ![](images/pi-ethdoc.png) &nbsp; <br>Crea la documentación de un contrato soldity - generada a partir de los comentarios Natspec en el código. La documentación generada se coloca en el visor EthDoc - que será visible en una pestaña del editor. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc/profile.json): ethdoc <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-ethdoc-plugin/issues)

source: **EthDoc Viewer** &nbsp; (main panel) &nbsp; <br>This plugin work with EthDoc Generator. It is automatically activated. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc-viewer/profile.json): ethdoc-viewer <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-ethdoc-viewer-plugin/issues)
es_es: **EthDoc Viewer** &nbsp; (panel principal) &nbsp; <br>Este plugin funciona con EthDoc Generator. Se activa automáticamente. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/ethdoc-viewer/profile.json): ethdoc-viewer <br>[Documentation](https://remix-ethdoc-plugin.readthedocs.io/en/latest/) <br>[Hacer una edición](https://github.com/Machinalabs/remix-ethdoc-viewer-plugin/issues)

source: **Etherscan Contract Verifier** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verify a contract on Etherscan. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/etherscan/profile.json): etherscan <br>[Documentation](https://remix-etherscan-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-etherscan-plugin/issues)
es_es: **Verificador de contratos Etherscan** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verifique un contrato en Etherscan. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/etherscan/profile.json): etherscan <br>[Documentation](https://remix-etherscan-plugin.readthedocs.io/en/latest/) <br>[Realizar una emisión](https://github.com/Machinalabs/remix-etherscan-plugin/issues)

source: **Flattener** &nbsp; ![](images/pi-flattener.png) <br>Flattens compiled contracts <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/flattener/profile.json): flattener <br>[Make an issue](https://github.com/bunsenstraat/flattener/issues)
es_es: **Flattener** &nbsp; ![](images/pi-flattener.png) <br>Aplana los contratos compilados <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/flattener/profile.json): flattener <br>[Make an issue](https://github.com/bunsenstraat/flattener/issues)

source: **Gas Profiler** &nbsp; ![](images/pi-gas-profiler.png) <br>Profile gas costs for every transaction you execute. Total execution costs as well as per line costs are displayed. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/gas-profiler/profile.json): gasProfiler <br>[Documentation](https://github.com/EdsonAlcala/remix-gas-profiler) <br>[Make an issue](/issues)
es_es: **Gas Profiler** &nbsp; ![](images/pi-gas-profiler.png) <br>Perfile los costes de gas de cada transacción que ejecute. Se muestran los costes totales de ejecución, así como los costes por línea. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/gas-profiler/profile.json): gasProfiler <br>[Documentation](https://github.com/EdsonAlcala/remix-gas-profiler) <br>[Hacer un issue](/issues)

source: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Deploy & interact with smart contracts to the Klaytn public network, local klaytn nodes. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentation](https://github.com/klaytn-ozys/plug-and-klay) <br>[Make an issue](https://github.com/klaytn-ozys/plug-and-klay/issues)
es_es: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Despliegue e interactúe con contratos inteligentes en la red pública Klaytn, nodos klaytn locales. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentation](https://github.com/klaytn-ozys/plug-and-klay) <br>[Hacer un issue](https://github.com/klaytn-ozys/plug-and-klay/issues)

source: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Remix & Solidity Tutorials <br>Tutorials that contain quizes that teach users Solidity and Remix features. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentation](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Make an issue](https://github.com/bunsenstraat/remix-learneth-plugin/issues)
es_es: **AprendaEth** &nbsp; ![](images/pi-learneth.png) &nbsp; Tutoriales de Remix y Solidity <br>Tutoriales que contienen quizes que enseñan a los usuarios las características de Solidity y Remix. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentation](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Hacer una edición](https://github.com/bunsenstraat/remix-learneth-plugin/issues)

source: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon is a language that reads like a legal contract and compile into Solidity (and then bytecode). This plugin allow you to take Lexon code and to <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentation](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Make an issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)
es_es: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon es un lenguaje que se lee como un contrato legal y compila en Solidity (y luego en bytecode). Este plugin le permite tomar código Lexon y <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentation](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Make an issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)

source: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compile and Deploy to the Moonbeam network <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentation](https://github.com/purestake/moonbeam-remix-plugin) <br>[Make an issue](https://github.com/PureStake/moonbeam-remix-plugin/issues)
es_es: **Rayo lunar** &nbsp; ![](images/pi-moonbeam.png) <br>Compile y despliegue en la red Rayo lunar <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentation](https://github.com/purestake/moonbeam-remix-plugin) <br>[Haga un issue](https://github.com/PureStake/moonbeam-remix-plugin/issues)

source: **Mythx Security Verification** &nbsp; ![](images/pi-mythx.png) <br>Free version and paid version for Mythx analysis. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentation](https://docs.mythx.io/tools-integrations/remix) <br>[Make an issue](https://github.com/aquiladev/remix-mythx-plugin/issues)
es_es: **Verificación de seguridad de Mythx** &nbsp; ![](images/pi-mythx.png) <br>Versión gratuita y versión de pago para el análisis de Mythx. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentation](https://docs.mythx.io/tools-integrations/remix) <br>[Hacer un issue](https://github.com/aquiladev/remix-mythx-plugin/issues)

source: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>Compile solidity contracts for the Nahmii network <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[Make an issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)
es_es: **Compilador Nahmii** &nbsp; ![](images/pi-moonbeam.png) <br>Compile contratos de solidez para la red Nahmii <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[Haga una edición](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)

source: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Makes a basic front end for your contract once it is deployed on a public testnet. [profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[Documentation](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Make an issue](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)
es_es: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Realiza un front-end básico para su contrato una vez desplegado en una red de pruebas pública. [nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[Documentation](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Haga una edición](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)

source: **Proveable Oracle Services** &nbsp; ![](images/pi-proveable.png) <br>An oracle for the Remix VM environment. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/provable/profile.json): provable <br>[Documentation](https://docs.provable.xyz/#development-tools-remix-ide-provable-plugin)
es_es: **Servicios de Oracle comprobables** &nbsp; ![](images/pi-proveable.png) <br>Un oráculo para el entorno Remix VM. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/provable/profile.json): provable <br>[Documentation](https://docs.provable.xyz/#development-tools-remix-ide-provable-plugin)

source: **Quorum Network** &nbsp; ![](images/pi-quorum.png) <br>A Connection to Quorum <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/quorum/profile.json): quorum <br>[Documentation](https://medium.com/remix-ide/quorum-plugin-for-remix-ee232ebca64c) <br>[Make an issue](https://github.com/ConsenSys/quorum-remix/issues)
es_es: **Red de Quórum** &nbsp; ![](images/pi-quorum.png) <br>Una conexión a Quórum <br>[nombre de perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/quorum/profile.json): quórum <br>[Documentation](https://medium.com/remix-ide/quorum-plugin-for-remix-ee232ebca64c) <br>[Hacer una emisión](https://github.com/ConsenSys/quorum-remix/issues)

source: **Solhint Linter** &nbsp; ![](images/pi-solhint.png) <br>Solidity Linter providing both Security and Style Guide validations. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/solhint/profile.json): solhint <br>[Documentation](https://protofire.github.io/solhint/docs/rules.html) <br>[Make an issue](https://github.com/protofire/remix-solhint-plugin)
es_es: **Solhint Linter** &nbsp; ![](images/pi-solhint.png) <br>Solidity Linter que proporciona validaciones tanto de Seguridad como de la Guía de Estilo. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/solhint/profile.json): solhint <br>[Documentation](https://protofire.github.io/solhint/docs/rules.html) <br>[Hacer una edición](https://github.com/protofire/remix-solhint-plugin)

source: **Solidity 2 UML** &nbsp; ![](images/pi-sol2uml.png) <br>Generate UML diagrams from a compiled Solidity file <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/sol2uml/profile.json): sol2uml <br>[Documentation](https://github.com/aquiladev/remix-sol2uml) <br>[Make an issue](https://github.com/aquiladev/remix-sol2uml)
es_es: **Solidity 2 UML** &nbsp; ![](images/pi-sol2uml.png) <br>Generar diagramas UML a partir de un archivo Solidity compilado <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/sol2uml/profile.json): sol2uml <br>[Documentation](https://github.com/aquiladev/remix-sol2uml) <br>[Hacer una edición](https://github.com/aquiladev/remix-sol2uml)

source: **Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verify you contracts and fetch verified contracts <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[Documentation](https://github.com/ethereum/sourcify) <br>[Make an issue](https://github.com/sourcifyeth/remix-sourcify/issues)
es_es: **Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verifique sus contratos y recupere los contratos verificados <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[Documentation](https://github.com/ethereum/sourcify) <br>[Haga una incidencia](https://github.com/sourcifyeth/remix-sourcify/issues)

source: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compile contracts written in Cairo to Starknet <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starknet-cairo1-compiler/profile.json): Starknet-cairo1-compiler <br>[Documentation](https://github.com/NethermindEth/starknet-remix-plugin) <br>[Make an issue](https://github.com/NethermindEth/starknet-remix-plugin/issues)
es_es: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compile los contratos escritos en Cairo a Starknet <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starknet-cairo1-compiler/profile.json): Starknet-cairo1-compiler <br>[Documentation](https://github.com/NethermindEth/starknet-remix-plugin) <br>[Haga una edición](https://github.com/NethermindEth/starknet-remix-plugin/issues)
