Repository: EdgarBarrantes/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_list.po
Languages: es_es

source: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verify Contracts. Import To Remix From your Tenderly project. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentation](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Make an issue](/issues)
es_es: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verificar Contratos. Importar a Remix Desde su proyecto Tenderly. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentation](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Hacer un issue](/issues)

source: **UMA Playground** &nbsp; (main panel) <br>Learn about the UMA protocol. This plugin is loaded from the DEFI Tutorial plugin. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Make an issue](https://github.com/Machinalabs/remix-uma-playground/issues)
es_es: **Parque de juegos UMA** &nbsp; (panel principal) <br>Conozca el protocolo UMA. Este plugin se carga desde el plugin DEFI Tutorial. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Hacer una edición](https://github.com/Machinalabs/remix-uma-playground/issues)

source: **UMA Tutorials** &nbsp; (main panel) <br>This plugin is activated by the DEFI Tutorials <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)
es_es: **UMA Tutorials** &nbsp; (panel principal) <br>Este plugin está activado por el DEFI Tutorials <br>[nombre de perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[Hacer una edición](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)

source: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compile vyper code using local or remote Vyper compiler. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentation](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Make an issue](https://github.com/GrandSchtroumpf/vyper-remix)
es_es: **Compilador Vyper** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compile código vyper utilizando el compilador Vyper local o remoto. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentation](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Haga una edición](https://github.com/GrandSchtroumpf/vyper-remix)

source: **Wallet Connect** &nbsp; (main panel) <br>Approve transactions on your mobile device <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Make an issue](https://github.com/yann300/remix-walletconnect/issues)
es_es: **Wallet Connect** &nbsp; (panel principal) <br>Aprobar transacciones en su dispositivo móvil <br>[nombre de perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Realizar una emisión](https://github.com/yann300/remix-walletconnect/issues)

source: **YUL++** &nbsp; ![](images/pi-yul-p.png) &nbsp; <br>A low level language for Ethereum. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/yulp/profile.json): yulp <br>[Make an issue](https://github.com/loredanacirstea/remix-yulp-plugin/issues)
es_es: **YUL++** &nbsp; ![](images/pi-yul-p.png) &nbsp; <br>Un lenguaje de bajo nivel para Ethereum. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/yulp/profile.json): yulp <br>[Hacer una edición](https://github.com/loredanacirstea/remix-yulp-plugin/issues)

source: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates is a toolbox for zkSNARKs on Ethereum. <br>[profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[Documentation](https://zokrates.github.io/) <br>[Make an issue](https://github.com/Zokrates/zokrates-remix-plugin/issues)
es_es: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates es una caja de herramientas para zkSNARKs en Ethereum. <br>[nombre del perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[Documentation](https://zokrates.github.io/) <br>[Hacer una emisión](https://github.com/Zokrates/zokrates-remix-plugin/issues)
